# Merging DataFrame

## Querying 1D series Data Structure and 2D (DataFrame) Data Structure 
### using Loc or iloc for Row querying and square brackets[ ] on object itself for Column based Query
we can query a DataFrame in Series using Boolean masking 
-Boolean masking is a powerful filtering method whic allows us to use broadcasting to determine what data shold be kepth in our analysis

In [1]:
import pandas as pd

purchase_1=pd.Series({'Name':'chris',
                      'item_purschased':'Dog food',
                     'cost':22.50})
purchase_2=pd.Series({'Name':'Keyvn',
                      'item_purschased':'kitty litter',
                     'cost':2.50})
purchase_3=pd.Series({'Name':'Vinod',
                      'item_purschased':'bird seed',
                     'cost':5.0})
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['Store 1','Store 2','Store 3'])
df

          Name  cost item_purschased
Store 1  chris  22.5        Dog food
Store 2  Keyvn   2.5    kitty litter
Store 3  Vinod   5.0       bird seed

## Adding Horizontally by using the column name and default scaler value

In [2]:
df['Delivered']=True
df

          Name  cost item_purschased  Delivered
Store 1  chris  22.5        Dog food       True
Store 2  Keyvn   2.5    kitty litter       True
Store 3  Vinod   5.0       bird seed       True

## Adding Horizontally by using the column name and different values in a Series but the list must be of same length as of dataFrame.

In [3]:
df['Date']=['December 1','January 1','Mid May']

df

          Name  cost item_purschased  Delivered        Date
Store 1  chris  22.5        Dog food       True  December 1
Store 2  Keyvn   2.5    kitty litter       True   January 1
Store 3  Vinod   5.0       bird seed       True     Mid May

In [4]:
df['Sery']=pd.Series({'Name':'Vinod',
                      'item_purschased':'bird seed',
                     'cost':5.0})
df

          Name  cost item_purschased  Delivered        Date Sery
Store 1  chris  22.5        Dog food       True  December 1  NaN
Store 2  Keyvn   2.5    kitty litter       True   January 1  NaN
Store 3  Vinod   5.0       bird seed       True     Mid May  NaN

## Adding  Series with lenght less than length of DatFrame

### 1) we have to Manually enter None or NaN where value is missing 
### 2) We have to pass a Dictionary as Series  such that keys of dictionary  mathching index of DatFrame will  help placing value at desired indices and missing will be left to NaN

In [5]:
adf=df.reset_index()
adf

     index   Name  cost item_purschased  Delivered        Date Sery
0  Store 1  chris  22.5        Dog food       True  December 1  NaN
1  Store 2  Keyvn   2.5    kitty litter       True   January 1  NaN
2  Store 3  Vinod   5.0       bird seed       True     Mid May  NaN

In [6]:
adf['Date']=pd.Series({0:'December 1',2:'Mid May'})
adf

     index   Name  cost item_purschased  Delivered        Date Sery
0  Store 1  chris  22.5        Dog food       True  December 1  NaN
1  Store 2  Keyvn   2.5    kitty litter       True         NaN  NaN
2  Store 3  Vinod   5.0       bird seed       True     Mid May  NaN

## Adding Horizontally by using the column name and a scaller value

In [7]:
df=df.append(pd.Series(data={'Cost':3.00,'Item Purchased':'Kitty Food'},name=('Store 4')))
df

,Name,cost,item_purschased,Delivered,Date,Sery,Cost,Item Purchased
Store 1,chris,22.5,Dog food,1.0,December 1,NaN,NaN,NaN
Store 2,Keyvn,2.5,kitty litter,1.0,January 1,NaN,NaN,NaN
Store 3,Vinod,5.0,bird seed,1.0,Mid May,NaN,NaN,NaN
Store 4,NaN,NaN,NaN,NaN,NaN,NaN,3.0,Kitty Food

##  c) Merging two DataFrame

### 1)  Union = Outer Join
### 2) Intersection= Inner Join

In [8]:
# Creating Two dataframes  with Name Column as its index

staff_df=pd.DataFrame([{'Name':'Kelly','Role':'Director HR'},
                 {'Name':'Sally','Role':'Course Liasion'},
                 {'Name':'James','Role':'Grader'}])
staff_df.set_index('Name')

student_df=pd.DataFrame([{'Name':'James','School':'Director HR'},
                 {'Name':'Mike','School':'Law'},
                 {'Name':'Sally','School':'Engineering'}])
student_df.set_index('Name')

print(staff_df)
print("\n")
print(student_df)

    Name            Role
0  Kelly     Director HR
1  Sally  Course Liasion
2  James          Grader


    Name       School
0  James  Director HR
1   Mike          Law
2  Sally  Engineering

## 1) Merge using Outer joint or Union

In [9]:
pd.merge(staff_df,student_df, how='outer',left_index=True,right_index=True)

  Name_x            Role Name_y       School
0  Kelly     Director HR  James  Director HR
1  Sally  Course Liasion   Mike          Law
2  James          Grader  Sally  Engineering

In [10]:
pd.merge(staff_df,student_df, how='outer')

    Name            Role       School
0  Kelly     Director HR          NaN
1  Sally  Course Liasion  Engineering
2  James          Grader  Director HR
3   Mike             NaN          Law


## 2) Intersection using inner joint

In [11]:
pd.merge(staff_df,student_df, how='inner')

    Name            Role       School
0  Sally  Course Liasion  Engineering
1  James          Grader  Director HR

In [12]:
pd.merge(staff_df,student_df, how='inner',left_index=True,right_index=True)

  Name_x            Role Name_y       School
0  Kelly     Director HR  James  Director HR
1  Sally  Course Liasion   Mike          Law
2  James          Grader  Sally  Engineering

## d) Merge only Staff who may be students also

In [13]:
pd.merge(staff_df,student_df,how='left')

    Name            Role       School
0  Kelly     Director HR          NaN
1  Sally  Course Liasion  Engineering
2  James          Grader  Director HR

### e) Merge only who are student or may be staff also

In [14]:
pd.merge(staff_df,student_df,how='right')

    Name            Role       School
0  Sally  Course Liasion  Engineering
1  James          Grader  Director HR
2   Mike             NaN          Law

## Challenging Exercise

In [32]:
products_df=pd.DataFrame([{'Product ID':'4109','Price':5.0,'Product':'Sushi Roll'},
                          {'Product ID':'1412','Price':0.5,'Product':'Egg'},
                          {'Product ID':'8931','Price':1.5,'Product':'Bagel'}])
products_df.set_index('Product ID')

invoices_df=pd.DataFrame([{'Customer':'Ali','Product ID':'4109','Quantity':1},
                          {'Customer':'Eric','Product ID':'1412','Quantity':12},
                          {'Customer':'Ande','Product ID':'8931','Quantity':6},
                          {'Customer':'Sam','Product ID':'4109','Quantity':2}])
invoices_df.set_index('Product ID')

           Customer  Quantity
Product ID
4109            Ali         1
1412           Eric        12
8931           Ande         6
4109            Sam         2

In [34]:
invoices_df

  Customer Product ID  Quantity
0      Ali       4109         1
1     Eric       1412        12
2     Ande       8931         6
3      Sam       4109         2

In [35]:
products_df

   Price     Product Product ID
0    5.0  Sushi Roll       4109
1    0.5         Egg       1412
2    1.5       Bagel       8931

In [36]:
df0=pd.merge(invoices_df,products_df,how='outer')
df0

  Customer Product ID  Quantity  Price     Product
0      Ali       4109         1    5.0  Sushi Roll
1      Sam       4109         2    5.0  Sushi Roll
2     Eric       1412        12    0.5         Egg
3     Ande       8931         6    1.5       Bagel

In [37]:
df0['Sum Price']=df0['Quantity']*df0['Price']
df0

  Customer Product ID  Quantity  Price     Product  Sum Price
0      Ali       4109         1    5.0  Sushi Roll        5.0
1      Sam       4109         2    5.0  Sushi Roll       10.0
2     Eric       1412        12    0.5         Egg        6.0
3     Ande       8931         6    1.5       Bagel        9.0

In [38]:
df0['Sum Price'].sum()

30.0

In [46]:


# solution
print(pd.merge(products_df, invoices_df, left_index=True, right_on='Product ID'))

Empty DataFrame
Columns: [Product ID, Price, Product, Product ID_x, Customer, Product ID_y, Quantity]
Index: []

In [40]:
pd.merge(products_df, invoices_df, left_index=True, right_on='Product ID')

Empty DataFrame
Columns: [Product ID, Price, Product, Product ID_x, Customer, Product ID_y, Quantity]
Index: []

In [45]:
products_df.set_index('Product ID')
invoices_df.set_index('Product ID')
pd.merge(products_df, invoices_df)
# invoices_df

   Price     Product Product ID Customer  Quantity
0    5.0  Sushi Roll       4109      Ali         1
1    5.0  Sushi Roll       4109      Sam         2
2    0.5         Egg       1412     Eric        12
3    1.5       Bagel       8931     Ande         6

## Multi Index Merge

### First Name of Student and Staff might overlap but last name might not:
### thats why we use list of multiple column as left_on and right_on

In [68]:
staff_df=pd.DataFrame([{'First Name':'Kelly','Last_Name':'Dejardeen','Role':'director HR'},
                       {'First Name':'Sally','Last_Name':'Brooks','Role':'course Liasion'},
                       {'First Name':'James','Last_Name':'Wilde','Role':'Grader'}])

student_df=pd.DataFrame([{'First Name':'James','Last_Name':'Hamound','Role':'Business'},
                       {'First Name':'Mike','Last_Name':'Smith','Role':'Law'},
                       {'First Name':'Sally','Last_Name':'Brooks','Role':'Engineering'}])

In [75]:
student_df

  First Name Last_Name         Role
0      James   Hamound     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [76]:
staff_df

  First Name  Last_Name            Role
0      Kelly  Dejardeen     director HR
1      Sally     Brooks  course Liasion
2      James      Wilde          Grader

In [77]:
pd.merge(student_df,staff_df,how='outer')

  First Name  Last_Name            Role
0      James    Hamound        Business
1       Mike      Smith             Law
2      Sally     Brooks     Engineering
3      Kelly  Dejardeen     director HR
4      Sally     Brooks  course Liasion
5      James      Wilde          Grader

In [78]:
pd.merge(student_df,staff_df,how='inner')

Empty DataFrame
Columns: [First Name, Last_Name, Role]
Index: []

## First Name of Student and Staff might overlap but last name might not:

### thats why we use list of multiple column as left_on and right_on

## right_on: Columns from the right DataFrame to use as keys

In [72]:
pd.merge(student_df,staff_df,how='inner',left_on=['First Name','Last_Name'],right_on=['First Name','Last_Name'])

  First Name Last_Name       Role_x          Role_y
0      Sally    Brooks  Engineering  course Liasion

In [83]:
pd.merge(student_df,staff_df,right_on=['First Name'],left_on=['Last_Name'])

Empty DataFrame
Columns: [First Name_x, Last_Name_x, Role_x, First Name_y, Last_Name_y, Role_y]
Index: []

### Since the column are not specified explicitly , merge uses the overlapping column names as the keys.

If the column names are different in each object, you can specify them separately using left_on and Right_on:

In [84]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [85]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [96]:
pd.merge(df3, df4,left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [94]:
pd.merge(df3,df4, how='outer')

MergeError: No common columns to perform merge on

##  Pandas Idiom

In [97]:
print(df.drop(df[df['Quantity'] == 0].index).rename(columns={'Weight': 'Weight (oz.)'}))

KeyError: 'Quantity'

In [98]:
f=(df.drop(df[df['Quantity']==0].index))

KeyError: 'Quantity'

In [ ]:
f=Category  Quantity  Weight
Item                                             
Pack                       Pack         1    33.0
Tent                    Shelter         1    80.0
Sleeping Pad              Sleep         0    27.0
Sleeping Bag              Sleep         1    20.0
Toothbrush/Toothpaste    Health         1     2.0
Sunscreen                Health         1     5.0
Medical Kit              Health         1     3.7
Spoon                   Kitchen         0     0.7
Stove                   Kitchen         1    20.0
Water Filter            Kitchen         1     1.8
Water Bottles           Kitchen         2    35.0
Pack Liner              Utility         1     1.0
Stuff Sack              Utility         0     1.0
Trekking Poles          Utility         1    16.0
Rain Poncho            Clothing         0     6.0
Shoes                  Clothing         1    12.0
Hat                    Clothing         1     2.5